{
	"insertMarkdownLintDisableComment": {
		"prefix": "markdownlint-disable",
		"body": "<!-- markdownlint-disable ${1:MD000 }-->",
		"description": "Disables one or more rules by name (MD013), alias (line-length), or tag (whitespace). Multiple rules are space-delimited (MD018 MD019). If no rules are specified, all rules are disabled. Takes effect starting with the line the comment is on."
	},
	"insertMarkdownLintEnableComment": {
		"prefix": "markdownlint-enable",
		"body": "<!-- markdownlint-enable ${1:MD000 }-->",
		"description": "Enables one or more rules by name (MD013), alias (line-length), or tag (whitespace). Multiple rules are space-delimited (MD018 MD019). If no rules are specified, all rules are enabled. Takes effect starting with the line the comment is on."
	},

	"insertMarkdownLintDisableFileComment": {
		"prefix": "markdownlint-disable-file",
		"body": "<!-- markdownlint-disable-file ${1:MD000 }-->",
		"description": "Disables one or more rules by name (MD013), alias (line-length), or tag (whitespace). Multiple rules are space-delimited (MD018 MD019). If no rules are specified, all rules are disabled. Applies to the entire file."
	},
	"insertMarkdownLintEnableFileComment": {
		"prefix": "markdownlint-enable-file",
		"body": "<!-- markdownlint-enable-file ${1:MD000 }-->",
		"description": "Enables one or more rules by name (MD013), alias (line-length), or tag (whitespace). Multiple rules are space-delimited (MD018 MD019). If no rules are specified, all rules are enabled. Applies to the entire file."
	},

	"insertMarkdownLintDisableLineComment": {
		"prefix": "markdownlint-disable-line",
		"body": "<!-- markdownlint-disable-line ${1:MD000 }-->",
		"description": "Disables one or more rules by name (MD013), alias (line-length), or tag (whitespace). Multiple rules are space-delimited (MD018 MD019). If no rules are specified, all rules are disabled. Applies to the current line only."
	},
	"insertMarkdownLintDisableNextLineComment": {
		"prefix": "markdownlint-disable-next-line",
		"body": "<!-- markdownlint-disable-next-line ${1:MD000 }-->",
		"description": "Disables one or more rules by name (MD013), alias (line-length), or tag (whitespace). Multiple rules are space-delimited (MD018 MD019). If no rules are specified, all rules are disabled. Applies to the next line only."
	},

	"insertMarkdownLintCaptureComment": {
		"prefix": "markdownlint-capture",
		"body": "<!-- markdownlint-capture -->",
		"description": "Captures the current rule configuration. Takes effect starting with the line the comment is on."
	},
	"insertMarkdownLintRestoreComment": {
		"prefix": "markdownlint-restore",
		"body": "<!-- markdownlint-restore -->",
		"description": "Restores the most recently captured rule configuration. Defaults to the document's initial configuration. Takes effect starting with the line the comment is on."
	},

	"insertMarkdownLintConfigureFileComment": {
		"prefix": "markdownlint-configure-file",
		"body": "<!-- markdownlint-configure-file { ${1:\"MD013\": { \"line_length\": 100 \\}} } -->",
		"description": "Configures one or more rules by name (MD013), alias (line-length), or tag (whitespace) using the same JSON format as the \"markdownlint.config\" object. Applies to the entire file."
	}
}
